# BuiltInFailures.RoomFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures Class
BuiltInFailures Class Members See Also
---
Failures about Room.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class RoomFailures
```

Visual Basic
---
```text
Public NotInheritable Class RoomFailures
```

Visual C++
---
```text
public ref class RoomFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..RoomFailures
# See Also
BuiltInFailures..::..RoomFailures Members
Autodesk.Revit.DB Namespace